app/views/diseases/_form.html.erb

                  <div class="input-group col-md-12 col-sm-12 col-xs-12 form-group">
                    <%= f.select :disease,
                      Disease.all.map { |u| [u.name, u.id] },
                      { include_blank: "Buscar Doença" },
                      { class: 'chosen-select' }
---
SELECT "diseases".* FROM "diseases"