app/views/pacients/_form.html.erb

SELECT "professions".* FROM "professions"
---
                  <div class="input-group col-md-12 col-sm-12 col-xs-12 form-group">
                    <%= f.select :profession_id,
                      Profession.all.map { |u| [u.description, u.id] },
                      { include_blank: "Buscar Profissão" },
                      { class: 'chosen-select' }

SELECT "service_accesses".* FROM "service_accesses"
---
                      <div class="col-md-12 col-sm-12 col-xs-12 form-group">
                        <%= f.select :service_access_id,
                          ServiceAccess.all.map { |u| [u.description, u.id] },
                          { include_blank: "Buscar Acesso ao Serviço" },
                          { class: 'chosen-select' }