app/controllers/attendances_controller.rb

  def index
    @attendances = Attendance.all
---
SELECT "attendances".* FROM "attendances" WHERE (pacient.cpf like '%0936%')

  def create
    @attendance = Attendance.new(attendance_params)

    respond_to do |format|
      if @attendance.save
---
INSERT INTO "attendances" ("general_screen", "attendance_date", "pacient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["general_screen", "Teste"], ["attendance_date", "2018-10-21 00:00:00.000000"], ["pacient_id", 1], ["created_at", "2018-10-21 21:55:26.717519"], ["updated_at", "2018-10-21 21:55:26.717519"]]

  def update
    respond_to do |format|
      if @attendance.update(attendance_params)
---
UPDATE "attendances" SET "attendance_date" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["attendance_date", "2018-10-28 00:00:00.000000"], ["updated_at", "2018-10-30 00:47:44.344384"], ["id", 4]]

  def destroy
    @attendance.destroy
---
DELETE FROM "attendances" WHERE "attendances"."id" = ?  [["id", 1]]

    def set_attendance
      @attendance = Attendance.find(params[:id])
---
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT 1  [["id", 4]]