app/controllers/care_plans_controller.rb

SELECT "care_plans".* FROM "care_plans"
---
  def index
    @care_plans = CarePlan.all