app/controllers/diseases_controller.rb

SELECT "diseases".* FROM "diseases"
---
  def index
    @diseases = Disease.all

INSERT INTO "diseases" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Teste"], ["description", "Teste doença"], ["created_at", "2018-10-21 23:18:47.821523"], ["updated_at", "2018-10-21 23:18:47.821523"]]
---
  def create
    @disease = Disease.new(disease_params)

    respond_to do |format|
      if @disease.save

UPDATE "diseases" SET "attendance_id" = ?, "updated_at" = ? WHERE "diseases"."id" = ?  [["attendance_id", 1], ["updated_at", "2018-10-21 23:45:25.104257"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @disease.update(disease_params)

DELETE FROM "diseases" WHERE "diseases"."id" = ?  [["id", 1]]
---
  def destroy
    @disease.destroy

SELECT  "diseases".* FROM "diseases" WHERE "diseases"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_disease
      @disease = Disease.find(params[:id])