app/controllers/pacients_controller.rb

SELECT "pacients".* FROM "pacients" WHERE (cpf like '%09379833%')
---
  def index
    if params[:pesquisa]
      @pacients = Pacient.pesquisa(params[:pesquisa])
    else
      @pacients = Pacient.all

SELECT "attendances".* FROM "attendances" WHERE "attendances"."pacient_id" = ?  ORDER BY "attendances"."attendance_date" DESC  [["pacient_id", 2]]
---
  def show
    @attendances = Attendance.where(pacient_id: @pacient.id).order(attendance_date: :desc)

SELECT "professions".* FROM "professions"
---
  def new
    @pacient = Pacient.new
    @profession = Profession.new
    @professionAtualiza = Profession.all.map { |u| [u.description, u.id] }

INSERT INTO "pacients" ("name", "place_attendence", "birth_date", "years_study", "genre", "marital_status", "phone", "address", "services_professional", "reason_meeting", "cpf", "profession_id", "service_access_id", "ub_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pacient = Pacient.new(pacient_params)
    @profession = Profession.new

    respond_to do |format|
      if @pacient.save

UPDATE "pacients" SET "birth_date" = ?, "updated_at" = ? WHERE "pacients"."id" = ?  [["birth_date", "1995-09-19"], ["updated_at", "2018-10-21 21:39:51.132773"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @pacient.update(pacient_params)

DELETE FROM "pacients" WHERE "pacients"."id" = ?  [["id", 1]]
---
  def destroy
    @pacient.destroy

SELECT  "pacients".* FROM "pacients" WHERE "pacients"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_pacient
      @pacient = Pacient.find(params[:id])