app/controllers/pharmacotherapies_controller.rb

  def index
    @pharmacotherapies = Pharmacotherapy.all
---
SELECT "pharmacotherapies".* FROM "pharmacotherapies"