app/controllers/professions_controller.rb

SELECT "professions".* FROM "professions"
---
  def index
    if params[:pesquisa]
      @professions = Profession.pesquisa(params[:pesquisa])
    else
      @professions = Profession.all