app/views/attendances/_form.html.erb

                  <label class="heard">Paciente:</label>
                  <%= f.select :pacient_id,
                      Pacient.all.map { |u| [u.name, u.id] },
                      { include_blank: "Buscar Paciente" },
                      { class: 'select2_single form-control' }
---
SELECT "pacients".* FROM "pacients"