app/views/pharmacotherapies/_form.html.erb

SELECT "pacients".* FROM "pacients"
---
      <label class="heard">Atendimento:</label>
                  <%= f.select :attendance_id,
                      Attendance.all.map { |u| ["#{u.pacient.name} - #{u.attendance_date}", u.id] },
                      { include_blank: "Buscar Atendimento" },
                      { class: 'select2_single form-control' }

SELECT "prms".* FROM "prms"
---
                  <div class="input-group col-md-12 col-sm-12 col-xs-12 form-group">
                    <%= f.select :prm_id,
                      Prm.all.map { |u| [u.description, u.id] },
                      { include_blank: "Buscar PRM" },
                      { class: 'select2_single form-control' }